$(() => {
// 打开表格
    $("#id img").click(() => $("#hide").css("display", "table"));
// 关闭表格
    $("#off").click(() => $("#hide").css("display", "none"));
// 身份信息处理
    // 狼人阵营
    $("#wolf").click(() => {
        $(".card").attr("src","../../image/id/wolf.jpg")
        $("#p1").html("伪装成好人混淆视听，淘汰真正的好人，达成胜利条件")
        $("#p2").html("每天晚上可以袭击一名玩家出局，白天可以自爆并立刻进入黑夜")
        $("#p3").html("1、白天自爆后，自爆的狼人会因为自爆而出局，此时跳过剩余的发言阶段<br>2、双爆吞警徽指的是两名玩家发动自爆技能后，警徽才会流失")
    });
    $("#robot").click(() => {
        $(".card").attr("src","../../image/id/robot.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("不和狼队友见面，晚上可以学习一名玩家，次夜开始使用学习的技能，最后一狼接刀")
        $("#p3").html("1、如果学习【通灵师】，则每天晚上可以查验玩家具体身份<br>2、如果学习【女巫】，则拥有一瓶毒药<br>3、如果学习【猎人】，出局带人规则同【猎人】<br>4、如果学习【守卫】，则可以保护狼刀和毒药<br>5、如果学习【平民】，则没有特殊技能<br>6、如果学习【狼人】，则在接刀时获得额外的【单独刀】")
    });
    $("#claw").click(() => {
        $(".card").attr("src","../../image/id/claw.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("刚开始不和狼队友见面，当狼人阵营存活人数≤2时，见面并获得觉醒刀")
        $("#p3").html("1、接刀后不能自爆<br>2、觉醒刀在狼刀之前，不保留，【醒刀无法被任何技能防御<br>3、无论接刀与否，被查验显示【狼人】")
    });
    $("#gargoyle").click(() => {
        $(".card").attr("src","../../image/id/gargoyle.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("每天晚上查验一名玩家的具体身份")
        $("#p3").html("1、当你成为最后一狼时，接刀，<br>2、无论接刀与否，查验技能依旧可以使用<br>3、无论接刀与否，被查验显示【狼人】")
    });
    $("#hidewolf").click(() => {
        $(".card").attr("src","../../image/id/hide.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("不和狼队见面，被查验显示为【好人】<br>强类型：可以看到其他狼队<br>弱类型：不可以看到其他狼队")
        $("#p3").html("1、如果是强类型，当你成为最后一狼时，接刀<br>2、隐狼类型详见对应的板子说明<br>3、无论接刀与否，被查验显示【好人】（除查验具体身份）")
    });
      $("#nightmare").click(() => {
        $(".card").attr("src","../../image/id/nightmare.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("每天晚上可以【恐惧】一名玩家，然后和狼队见面并袭击玩家，被【恐惧】的玩家无法发动技能")
        $("#p3").html("1、如果恐惧到带刀狼，则当晚狼队全员无法袭击<br>2、可以不恐惧玩家<br>3、在第一晚带刀狼行动之前，【噩梦之影】看不到队友")
    });
    $("#brother_wolf").click(() => {
        $(".card").attr("src","../../image/id/brother_wolf.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("先和【狼弟】相互确认位置，然后和【狼人】一起袭击玩家")
        $("#p3").html("1、其他【狼人】不知道【狼弟】的位置<br>2、【狼兄】无法自爆")
    });
     $("#wolf_brother").click(() => {
        $(".card").attr("src","../../image/id/wolf_brother.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("先和【狼兄】相互确认位置，在【狼兄】出局后，狼弟获得【狂暴刀】并在【狂暴刀】的下一晚和剩余【狼人】见面")
        $("#p3").html("1、狼弟的【狂暴刀】可以被保护，但是无法被女巫解救<br>2、【狂暴刀】不会保留<br>3、在【狼兄】出局前被查验显示为【好人】（除查验具体身份）<br>4、在【狼兄】出局后被查验显示为【狼人】")
    });
     $("#BV").click(() => {
        $(".card").attr("src","../../image/id/BV.jpg")
        $("#p1").html("属于狼人阵营，胜利条件和狼人相同")
        $("#p2").html("每天晚上可以对一名玩家发动【票型污染】，使该玩家次日白天的放逐票变为【无效票】")
        $("#p3").html("1、不能连续同一晚对玩家发动【票型污染】<br>2、不能对自己发动技能<br>3、如果该玩家投票，则会显示哪名玩家身上有【无效票】<br>4、如果该玩家弃票，则【黑票法师】的技能冷却一天")
    });
    // 平民/特殊阵营
    $("#villager").click(() => {
        $(".card").attr("src","../../image/id/villager.jpg")
        $("#p1").html("沉着冷静的发言并分析，谨慎投出每一票，淘汰所有狼人")
        $("#p2").html("无特殊技能")
        $("#p3").html("暂无")
    });
    $("#postman").click(() => {
        $(".card").attr("src","../../image/id/postman.jpg")
        $("#p1").html("属于好人平民，胜利条件与平民相同")
        $("#p2").html("首夜获得淘女郎购买的商品，出局时可【翻牌】")
        $("#p3").html("1、如果【淘女郎】选择的是“查验”和“毒药”，则会在第三天夜晚送达<br>2、如果【淘女郎】选择的是【猎枪】，则会在第三天白天送达<br>3、在【淘女郎】获得商品期间如果出局，则淘女郎无法获得技能")
    });
    // 神职阵营 
    $("#seer").click(() => {
        $(".card").attr("src","../../image/id/seer.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("每天晚上查验一名玩家是【好人】还是【狼人】")
        $("#p3").html("1、无法查验具体身份<br>2、注意某些版型的特殊角色是不可验牌，可能会导致预言家查验有错误")
    });
     $("#witch").click(() => {
        $(".card").attr("src","../../image/id/witch.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("拥有一瓶解药和一瓶毒药：<br>解药：可以救活晚上被狼人阵营袭击的玩家<br>毒药：可以毒杀一名玩家出局")
        $("#p3").html("1、每瓶药只有一瓶，且每晚只能使用一瓶药，可以空过<br>2、当【解药】还留存的时候可以看到狼人阵营袭击了谁，但是【解药】一旦用掉，则女巫将不会看到该信息")
    });
      $("#hunter").click(() => {
        $(".card").attr("src","../../image/id/hunter.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("如果不是因为【某些原因】而出局，可以翻牌并开枪猎杀一名玩家")
        $("#p3").html("1、如果版型有【狼王】】或【机械狼】，则出局并不能翻牌，但还是可以猎杀玩家<br>2、【某些原因】详见对应的板子说明")
    });
    $("#guard").click(() => {
        $(".card").attr("src","../../image/id/guard.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("每天晚上可以保护一名玩家使他免疫袭击")
        $("#p3").html("1、可以保护自己<br>2、不能连续两晚保护同一名玩家<br>3、如果被保护的玩家被狼队袭击，且被女巫解救，那么该玩家还是会出局，女巫的解药也会视为使用")
    });
    $("#dream").click(() => {
        $(".card").attr("src","../../image/id/dream.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("每天晚上梦游一名玩家，被梦游的玩家免疫一切伤害")
        $("#p3").html("1、不可以空摄<br>2、如果摄梦人夜晚出局，梦游者会被梦亡出局<br>3、如果该玩家被连续两天摄梦，梦游者会被梦亡出局")
    });
    $("#psychic").click(() => {
        $(".card").attr("src","../../image/id/psychic.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("每天晚上查验一名玩家的具体身份")
        $("#p3").html("1、如果【机械狼】没有学习技能被查验，结果显示【机械狼】<br>2、如果【机械狼】学习了技能被查验，结果显示机械狼学习的身份")
    });
    $("#taobao").click(() => {
        $(".card").attr("src","../../image/id/taobao.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("首夜可以从【查验】，【毒药】和【猎枪】里选择一个作为【商品】")
        $("#p3").html("1、第一天必须选择<br>2、如果你选择了【查验】或【毒药】，则会在第三天夜晚获得该技能<br>3、如果你选择了【猎枪】，则会在第三天白天获得该技能")
    });
     $("#vote").click(() => {
        $(".card").attr("src","../../image/id/vote.jpg")
        $("#p1").html("属于好人神职，胜利条件与平民相同")
        $("#p2").html("拥有三个技能：<br>禁锢：每天晚上禁锢一名玩家，该玩家次日白天无法进行放逐投票<br>祝福：祝福一名玩家，该玩家次日白天放逐的一票变为两票<br>诅咒：诅咒一名玩家，该玩家次日白天放逐投票时身上自动多一票")
        $("#p3").html("1、三个技能可以在同一天使用<br>2、除了【禁锢】外，其他技能只能发动一次<br>3、使用【祝福】和【诅咒】时，会在公布票型的时候，显示被票玩家是因为什么而多一票<br>4、每名玩家只能【禁锢】一次<br>5、被【禁锢】的玩家会在放逐发言之后，放逐投票之前公示<br>6、全技能均不可对自己使用")
    });
})